<script setup lang="ts"></script>

<template>
  <div
    class="max-w-[1920px] max-h-[1080px] w-full h-screen relative flex justify-center items-center"
  >
    <div
      class="absolute -z-10 w-full h-full bg-[url('@/assets/description.png')] bg-cover filter brightness-[40%] bg-center"
    ></div>
    <div
      class="z-20 flex flex-col gap-[31px] max-w-[1160px] gap-[36px] bg-white rounded-[24px] p-[60px] text-[18px]"
    >
      <p class="text-[38px] font-bold">Надежность. Качество. Рост.</p>
      <p>
        <b>Профит-Лига</b> — это много больше, чем просто компания. Мы — гигант
        в мире автомобильных запасных частей, объединяющий более 250 брендов и
        насчитывающий свыше 180 000 позиций на своих складах. Наш успех основан
        на прямых контрактах с ведущими заводами-производителями, что
        обеспечивает непрерывное обновление ассортимента.
      </p>
      <p>
        Сеть наших складов, которые являются крупнейшими в ЮФО и СКФО,
        охватывает общую площадь свыше <b>40 000 кв.м.</b> <br />
        Мы не просто занимаемся распределением автозапчастей, мы обеспечиваем их
        доступность в крупных городах, включая
        <b
          >Ростов-на-Дону, Краснодар, Ставрополь, Волгоград, Пятигорск,
          Астрахань, Воронеж, Кропоткин, Симферополь, Новороссийск, Сочи,
          Владикавказ, Майкоп, Махачкала и Москву.</b
        >
      </p>
      <p>
        Современные методы работы службы логистики гарантируют высокое качество
        обслуживания наших клиентов. Но в сердце <b>Профит-Лиги</b> — это наши
        сотрудники, более 1000 профессионалов, которые приходят на работу каждый
        день со счастливыми лицами, чтобы вносить свой вклад в успех компании.
      </p>
      <p class="font-bold">
        Профит-Лига — это не только бизнес, это команда, объединенная общими
        целями и стремлением к развитию.
      </p>
    </div>
  </div>
</template>
